// ---------------------------------------------Task_1-----------------------------------------------
// 




// ---------------------------------------------Task_2-----------------------------------------------
// Найдите сумму цифр числа

// int GetSumOfDigits(int num) {
//     if (num != 0) {
//         return GetSumOfDigits(num / 10) + num % 10;
//     }
//     return 0;
// }

// Console.Write(GetSumOfDigits(1342));


// ---------------------------------------------Task_3-----------------------------------------------
// Задайте значения M и N. Напишите программу, которая выведет все натуральные числа в промежутке от M до N.





// ---------------------------------------------Task_4-----------------------------------------------
// Напишите программу, которая на вход принимает два числа A и B, и возводит число А в целую степень B.





