"use strict";

/*
Необходимо создать переменную в которой будет храниться температура в градусах Цельсия, преобразовать значение в температуру по фаренгейту.
Формула перевода градусов Цельсия в градусы Фаренгейта: градусы Фаренгейта = (9 / 5) * градусы Цельсия + 32
Вывести в консоль температуру в Цельсиях и Фаренгейтах.
*/

let celsius_degree = 20;
let farenghejt_degree = (9 / 5) * celsius_degree + 32;
console.log(`${celsius_degree} в градусах Цельсия = ${farenghejt_degree} в градусах по Фаренгейту`);


