-- Создайте представление, в которое попадет информация о пользователях (имя, фамилия, город и пол), которые не старше 20 лет.

-- Найдите кол-во отправленных сообщений каждым пользователем и выведите ранжированный список пользователей,
-- указав имя и фамилию пользователя, количество отправленных сообщений и место в рейтинге 
-- (первое место у пользователя с максимальным количеством сообщений) . (используйте DENSE_RANK)

-- Выберите все сообщения, отсортируйте сообщения по возрастанию даты отправления (created_at) 
-- и найдите разницу времени отправления между соседними сообщениями, получившегося списка. (используйте LEAD или LAG)


